Config.Basicneeds = {
    ["bread"] = {
        Time = 5, -- @==> เวลาในทำกิจกรรมไอเทมนี้
        Remove = true, -- @==> ต้องการให้ลบไอเทมที่ใช้งานไหมหากไม่ต้องการปรับเป็น false
        TextProgress = "กำลังทานขนมปัง", -- @==> ข้อความหลอดโหลด

        Animation = { -- @==> ท่าทาง
            RequestAnimDict = "mp_player_intdrink",
            TaskPlayAnim = "loop_bottle"
        },

        AllowJob = { -- @==> อาชีพที่สามารถใช้ไอเทมนี้ได้ (ถ้าต้องการให้กินได้ทุกอาชีพให้เว้นวาง)
            -- "police",
        },

        ItemNeeds = { -- @==> ไอเทมที่ต้องการ (ถ้าไม่ต้องการให้ตรวจสอบไอเทมก่อนให้เว้นว่างได้เลย)
            -- ["ชื่อไอเทม"] = {
            --     Remove = false, -- @==> ให้ลบไอเทมไหม
            --     Count = 5 -- @==> จำนวนไอเทมที่ต้องการ
            -- },
        },

        AllowZones = {
            Enable = false, -- @==> เปิดใช้งาน กินจำกัดโซน
            ZoneName = '', -- @==> ชื่อโซน
            
            ZoneList = { -- @==> โซนกินอาหาร

            }
        },

        StatusChange = { -- @==> หลอดต่างๆที่จะเปลี่ยนแปลง
            ["hunger"] = {
                Type = "plus", -- @==> plus บวกจำนวนเพิ่มจากเดิม | remove ลบจำนวนจากเดิม
                Count = 20 -- @==> จำนวนที่เปลี่ยนแปลง
            },
        },

        ObjectOnHand = { -- @==> พร็อพบนมือ
            Name = "prop_cs_burger_01", -- @==> ชื่อพร็อบ
            BoneIndex = 18905, -- @==> ตำแหน่งกระดูก
            xPos = 0.12, yPos = 0.028, zPos = 0.001, xRot = 10.0, yRot = 175.0, zRot = 0.0 -- @==> ตำแหน่งพร็อพ
        },

        FreezeSetting = { -- @==> ระบบล็อคขา
            Enable = false, -- @==> เปิดใช้งาน
            Type = "normal", -- @==> normal = ล็อคขาทั่วไป | zone = ล็อคขาเป็นโซน

            Zone = { -- @==> จะสามารถใช้ได้ในกรณีที่ Type = "zone"
                -- {
                --     Coords = vector3(-542.573, -657.427, 33.269), -- @==> จุดศูนย์กลาง
                --     Radis = 100 -- @==> ความกว้างจากจุดศูนย์กลาง
                -- },
            }
        },

        Sound = { -- @==> เสียงตอนกิน
            Enable = true, -- @==> เปิดใช้งาน
            FileName = "eat" -- @==> ไฟล์เสียง
        },

        EffectScreen = { -- @==> เอฟเฟคหน้าจอ
            Enable = false, -- @==> เปิดใช้งานไหม
            TimeEffect = 30, -- @==> ให้เอฟเฟครันกี่วิถึงปกติ (วินาที)
            Effect = "spectator5", -- @==> ชื่อเอฟเฟค
            WalkAnimation = "move_m@drunk@slightlydrunk" -- @==> ท่าเดิน
        }
    },
    ["water"] = {
        Time = 5, -- @==> เวลาในทำกิจกรรมไอเทมนี้
        Remove = true, -- @==> ต้องการให้ลบไอเทมที่ใช้งานไหมหากไม่ต้องการปรับเป็น false
        TextProgress = "กำลังดื่มน้ำ", -- @==> ข้อความหลอดโหลด

        Animation = { -- @==> ท่าทาง
            RequestAnimDict = "mp_player_intdrink",
            TaskPlayAnim = "loop_bottle"
        },

        AllowJob = { -- @==> อาชีพที่สามารถใช้ไอเทมนี้ได้ (ถ้าต้องการให้กินได้ทุกอาชีพให้เว้นวาง)
            -- "police",
        },

        ItemNeeds = { -- @==> ไอเทมที่ต้องการ (ถ้าไม่ต้องการให้ตรวจสอบไอเทมก่อนให้เว้นว่างได้เลย)
            -- ["ชื่อไอเทม"] = {
            --     Remove = false, -- @==> ให้ลบไอเทมไหม
            --     Count = 5 -- @==> จำนวนไอเทมที่ต้องการ
            -- },
        },

        AllowZones = {
            Enable = false, -- @==> เปิดใช้งาน กินจำกัดโซน
            ZoneName = '', -- @==> ชื่อโซน
            
            ZoneList = { -- @==> โซนกินอาหาร
                -- {
                --     Coords = vector3(-1578.15, -3108.02, 13.93), -- @==> จุดศูนย์กลาง
                --     Radis = 100, -- @==> ระยะห่างจากจุดศูนย์กลางd
                -- },


            }
        },

        StatusChange = { -- @==> หลอดต่างๆที่จะเปลี่ยนแปลง
            ["thirst"] = {
                Type = "plus", -- @==> plus บวกจำนวนเพิ่มจากเดิม | remove ลบจำนวนจากเดิม
                Count = 20 -- @==> จำนวนที่เปลี่ยนแปลง
            },
        },

        ObjectOnHand = { -- @==> พร็อพบนมือ
            Name = "prop_ld_flow_bottle", -- @==> ชื่อพร็อบ
            BoneIndex = 18905, -- @==> ตำแหน่งกระดูก
            xPos = 0.12, yPos = 0.028, zPos = 0.018, xRot = -95.0, yRot = 20.0, zRot = -40.0, -- @==> ตำแหน่งพร็อพ
        },

        FreezeSetting = { -- @==> ระบบล็อคขา
            Enable = false, -- @==> เปิดใช้งาน
            Type = "normal", -- @==> normal = ล็อคขาทั่วไป | zone = ล็อคขาเป็นโซน

            Zone = { -- @==> จะสามารถใช้ได้ในกรณีที่ Type = "zone"
                -- {
                --     Coords = vector3(-542.573, -657.427, 33.269), -- @==> จุดศูนย์กลาง
                --     Radis = 100 -- @==> ความกว้างจากจุดศูนย์กลาง
                -- },


            }
        },

        Sound = { -- @==> เสียงตอนกิน
            Enable = true, -- @==> เปิดใช้งาน
            FileName = "drink" -- @==> ไฟล์เสียง
        },

        EffectScreen = { -- @==> เอฟเฟคหน้าจอ
            Enable = false, -- @==> เปิดใช้งานไหม
            TimeEffect = 30, -- @==> ให้เอฟเฟครันกี่วิถึงปกติ (วินาที)
            Effect = "spectator5", -- @==> ชื่อเอฟเฟค
            WalkAnimation = "move_m@drunk@slightlydrunk" -- @==> ท่าเดิน
        }
    },
    ["beer"] = {
        Time = 5, -- @==> เวลาในทำกิจกรรมไอเทมนี้
        Remove = true, -- @==> ต้องการให้ลบไอเทมที่ใช้งานไหมหากไม่ต้องการปรับเป็น false
        TextProgress = "กำลังดื่มเบียร์", -- @==> ข้อความหลอดโหลด

        Animation = { -- @==> ท่าทาง
            RequestAnimDict = "mp_player_intdrink",
            TaskPlayAnim = "loop_bottle"
        },

        AllowJob = { -- @==> อาชีพที่สามารถใช้ไอเทมนี้ได้ (ถ้าต้องการให้กินได้ทุกอาชีพให้เว้นวาง)
            -- "police",
        },

        ItemNeeds = { -- @==> ไอเทมที่ต้องการ (ถ้าไม่ต้องการให้ตรวจสอบไอเทมก่อนให้เว้นว่างได้เลย)
            -- ["ชื่อไอเทม"] = {
            --     Remove = false, -- @==> ให้ลบไอเทมไหม
            --     Count = 5 -- @==> จำนวนไอเทมที่ต้องการ
            -- },
        },

        AllowZones = {
            Enable = true, -- @==> เปิดใช้งาน กินจำกัดโซน
            ZoneName = 'โซนกินเบียร์', -- @==> ชื่อโซน
            
            ZoneList = { -- @==> โซนกินอาหาร
                {
                    Coords = vector3(-1578.15, -3108.02, 13.93), -- @==> จุดศูนย์กลาง
                    Radis = 100, -- @==> ระยะห่างจากจุดศูนย์กลางd
                },
            }
        },

        StatusChange = { -- @==> หลอดต่างๆที่จะเปลี่ยนแปลง
            ["stress"] = {
                Type = "remove", -- @==> plus บวกจำนวนเพิ่มจากเดิม | remove ลบจำนวนจากเดิม
                Count = 10, -- @==> จำนวนที่เปลี่ยนแปลง
            },
            ["thirst"] = {
                Type = "plus", -- @==> plus บวกจำนวนเพิ่มจากเดิม | remove ลบจำนวนจากเดิม
                Count = 10, -- @==> จำนวนที่เปลี่ยนแปลง
            },
        },

        ObjectOnHand = { -- @==> พร็อพบนมือ
            Name = "prop_amb_beer_bottle", -- @==> ชื่อพร็อบ
            BoneIndex = 18905, -- @==> ตำแหน่งกระดูก
            xPos = 0.13, yPos = 0.005, zPos = 0.020, xRot = 270.0, yRot = 175.0, zRot = 20.0, -- @==> ตำแหน่งพร็อพ
        },

        FreezeSetting = { -- @==> ระบบล็อคขา
            Enable = true, -- @==> เปิดใช้งาน
            Type = "normal", -- @==> normal = ล็อคขาทั่วไป | zone = ล็อคขาเป็นโซน

            Zone = { -- @==> จะสามารถใช้ได้ในกรณีที่ Type = "zone"
                -- {
                --     Coords = vector3(-542.573, -657.427, 33.269), -- @==> จุดศูนย์กลาง
                --     Radis = 100 -- @==> ความกว้างจากจุดศูนย์กลาง
                -- },


            }
        },

        Sound = { -- @==> เสียงตอนกิน
            Enable = true, -- @==> เปิดใช้งาน
            FileName = "drink" -- @==> ไฟล์เสียง
        },

        EffectScreen = { -- @==> เอฟเฟคหน้าจอ
            Enable = true, -- @==> เปิดใช้งานไหม
            TimeEffect = 60, -- @==> ให้เอฟเฟครันกี่วิถึงปกติ (วินาที)
            Effect = "spectator5", -- @==> ชื่อเอฟเฟค
            WalkAnimation = "move_m@drunk@slightlydrunk" -- @==> ท่าเดิน
        }
    },
    ["cigarette"] = {
        Time = 5, -- @==> เวลาในทำกิจกรรมไอเทมนี้
        Remove = true, -- @==> ต้องการให้ลบไอเทมที่ใช้งานไหมหากไม่ต้องการปรับเป็น false
        TextProgress = "กำลังสูบบุหรี่", -- @==> ข้อความหลอดโหลด

        Animation = { -- @==> ท่าทาง
            RequestAnimDict = "amb@world_human_aa_smoke@male@idle_a",
            TaskPlayAnim = "idle_c"
        },

        AllowJob = { -- @==> อาชีพที่สามารถใช้ไอเทมนี้ได้ (ถ้าต้องการให้กินได้ทุกอาชีพให้เว้นวาง)
            -- "police",
        },

        ItemNeeds = { -- @==> ไอเทมที่ต้องการ (ถ้าไม่ต้องการให้ตรวจสอบไอเทมก่อนให้เว้นว่างได้เลย)
            ["lighter"] = {
                Remove = false, -- @==> ให้ลบไอเทมไหม
                Count = 1 -- @==> จำนวนไอเทมที่ต้องการ
            },
        },

        AllowZones = {
            Enable = false, -- @==> เปิดใช้งาน กินจำกัดโซน
            ZoneName = '', -- @==> ชื่อโซน
            
            ZoneList = { -- @==> โซนกินอาหาร

            }
        },

        StatusChange = { -- @==> หลอดต่างๆที่จะเปลี่ยนแปลง
            ["stress"] = {
                Type = "remove", -- @==> plus บวกจำนวนเพิ่มจากเดิม | remove ลบจำนวนจากเดิม
                Count = 20 -- @==> จำนวนที่เปลี่ยนแปลง
            },
        },

        ObjectOnHand = { -- @==> พร็อพบนมือ
            Name = "prop_cs_ciggy_01", -- @==> ชื่อพร็อบ
            BoneIndex = 28422, -- @==> ตำแหน่งกระดูก
            xPos = 0.0, yPos = 0.0, zPos = 0.0, xRot = 0.0, yRot = 0.0, zRot = 0.0, -- @==> ตำแหน่งพร็อพ
        },

        FreezeSetting = { -- @==> ระบบล็อคขา
            Enable = true, -- @==> เปิดใช้งาน
            Type = "normal", -- @==> normal = ล็อคขาทั่วไป | zone = ล็อคขาเป็นโซน

            Zone = { -- @==> จะสามารถใช้ได้ในกรณีที่ Type = "zone"
                -- {
                --     Coords = vector3(-542.573, -657.427, 33.269), -- @==> จุดศูนย์กลาง
                --     Radis = 100 -- @==> ความกว้างจากจุดศูนย์กลาง
                -- },

                
            }
        },

        Sound = { -- @==> เสียงตอนกิน
            Enable = false, -- @==> เปิดใช้งาน
            FileName = "eat" -- @==> ไฟล์เสียง
        },

        EffectScreen = { -- @==> เอฟเฟคหน้าจอ
            Enable = false, -- @==> เปิดใช้งานไหม
            TimeEffect = 30, -- @==> ให้เอฟเฟครันกี่วิถึงปกติ (วินาที)
            Effect = "spectator5", -- @==> ชื่อเอฟเฟค
            WalkAnimation = "move_m@drunk@slightlydrunk" -- @==> ท่าเดิน
        }
    },
}
