Config = {}

Config.EventRoute = {
    getSharedObject = 'esx:getSharedObject', -- @==> framework
    playerDropped = 'playerDropped' -- @==> player exit game
}

Config.UserLicense = "PUT KEY" -- @==> ใส่คีย์ที่ได้รับจากทางร้าน

Config.Debug = true -- @==> โหมดพัฒนา
Config.VolumeSounds = 1.0 -- @==> ความดังของเสียงทั้งหมด

Config.TimeSettings = { -- @==> ตั้งค่าเวลาต่างๆ (หน่วยวินาทีทั้งหมด)
    ChangeStatus = 1, -- @==> เวลาในการเปลี่ยนแปลง Status
    RemoveHealth = 5, -- @==> เวลาในการลดเลือด
    SoundLoop = 5, -- @==> เวลาในการเล่นเสียงเมื่อใช้ Type = "loop"
    MoreSettingsLoop = 30 -- @==> เวลาในการทำงานฟังชั่น MoreSettings
}

Config.Command = {
    Heal = { -- @==> คำสั่ง Heal
        Enable = true, -- @==> เปิดใช้งาน
        Command = 'heal', -- @==> คำสั่งฮีล

        AllowGroup = { -- @==> Group ที่สามารถใช้คำสั่งได้
            "superadmin",
            "admin"
        }
    },

    HealAll = { -- @==> คำสั่ง Heal
        Enable = true, -- @==> เปิดใช้งาน
        Command = 'healall', -- @==> คำสั่งฮีล

        AllowGroup = { -- @==> Group ที่สามารถใช้คำสั่งได้
            "superadmin",
            "admin"
        }
    }
}

Config.Status = {
    ['hunger'] = {
        Type = "remove", -- @==> ถ้าตั้งเป็น remove หลอดจะลดจากมากสุดไปน้อยสุด | ถ้าตั้งเป็น plus หลอดจะเพิ่มจากน้อยสุดไปมากสุด
        ChangeCount = 0.01, -- @==> จำนวนที่หลอดลดตามเวลาที่กำหนด 1 ครั้ง

        RemoveHealth = { -- @==> ลดเลือด
            Enable = true, -- @==> เปิดใช้งาน ระบบ ลดเลือดไหม
            StatusCount = 0, -- @==> หาก Type = "remove" จะเป็นจำนวนสเตตัสต่ำกว่าเท่านี้ถึงเริ่มลดเลือด | หาก Type = "plus" จะเป็นจำนวนสเตตัสมากกว่าเท่านี้ถึงเริ่มลดเลือด
            Remove = 1, -- @==> จำนวนเลือดที่ให้ลดตามเวลาต่อครั้ง
        },

        Sound = { -- @==> เล่นเสียง
            Enable = true, -- @==> เปิดใช้งาน ระบบ เล่นเสียงไหม
            Type = "loop", -- @==> หากตั้งเป็น loop เสียงจะเล่นซ้ำไปตามเวลาที่กำหนดวนไปเรื่อยๆ | หากตั้งเป็น count เสียงจะเล่นเมื่อถึงจำนวนนั้นๆ

            Settings = { -- @==> หาก loop ให้ใส่แค่จำนวนเดียว หาก count สามารถใส่ได้หลายจำนวน
                [10] = "dosomething",
            },
        },

        MoreSettings = function(Count) -- @==> Custom ฟั่งชั่นต่างๆของ Status นั้นๆ

        end,
    },
    ['thirst'] = {
        Type = "remove", -- @==> ถ้าตั้งเป็น remove หลอดจะลดจากมากสุดไปน้อยสุด | ถ้าตั้งเป็น plus หลอดจะเพิ่มจากน้อยสุดไปมากสุด
        ChangeCount = 0.01, -- @==> จำนวนที่หลอดลดตามเวลาที่กำหนด 1 ครั้ง

        RemoveHealth = { -- @==> ลดเลือด
            Enable = true, -- @==> เปิดใช้งาน ระบบ ลดเลือดไหม
            StatusCount = 0, -- @==> หาก Type = "remove" จะเป็นจำนวนสเตตัสต่ำกว่าเท่านี้ถึงเริ่มลดเลือด | หาก Type = "plus" จะเป็นจำนวนสเตตัสมากกว่าเท่านี้ถึงเริ่มลดเลือด
            Remove = 1, -- @==> จำนวนเลือดที่ให้ลดตามเวลาต่อครั้ง
        },

        Sound = { -- @==> เล่นเสียง
            Enable = true, -- @==> เปิดใช้งาน ระบบ เล่นเสียงไหม
            Type = "count", -- @==> หากตั้งเป็น loop เสียงจะเล่นซ้ำไปตามเวลาที่กำหนดวนไปเรื่อยๆ | หากตั้งเป็น count เสียงจะเล่นเมื่อถึงจำนวนนั้นๆ

            Settings = { -- @==> หาก loop ให้ใส่แค่จำนวนเดียว หาก count สามารถใส่ได้หลายจำนวน
                [10] = "dosomething",
                [5] = "dosomething",
            },
        },

        MoreSettings = function(Count) -- @==> Custom ฟั่งชั่นต่างๆของ Status นั้นๆ
            
        end,
    },
    ['dirty'] = {
        Type = "plus", -- @==> ถ้าตั้งเป็น remove หลอดจะลดจากมากสุดไปน้อยสุด | ถ้าตั้งเป็น plus หลอดจะเพิ่มจากน้อยสุดไปมากสุด
        ChangeCount = 0.01, -- @==> จำนวนที่หลอดลดตามเวลาที่กำหนด 1 ครั้ง

        RemoveHealth = { -- @==> ลดเลือด
            Enable = true, -- @==> เปิดใช้งาน ระบบ ลดเลือดไหม
            StatusCount = 100, -- @==> หาก Type = "remove" จะเป็นจำนวนสเตตัสต่ำกว่าเท่านี้ถึงเริ่มลดเลือด | หาก Type = "plus" จะเป็นจำนวนสเตตัสมากกว่าเท่านี้ถึงเริ่มลดเลือด
            Remove = 1, -- @==> จำนวนเลือดที่ให้ลดตามเวลาต่อครั้ง
        },

        Sound = { -- @==> เล่นเสียง
            Enable = true, -- @==> เปิดใช้งาน ระบบ เล่นเสียงไหม
            Type = "loop", -- @==> หากตั้งเป็น loop เสียงจะเล่นซ้ำไปตามเวลาที่กำหนดวนไปเรื่อยๆ | หากตั้งเป็น count เสียงจะเล่นเมื่อถึงจำนวนนั้นๆ

            Settings = { -- @==> หาก loop ให้ใส่แค่จำนวนเดียว หาก count สามารถใส่ได้หลายจำนวน
                [40] = "dosomething",
            },
        },

        MoreSettings = function(Count) -- @==> Custom ฟั่งชั่นต่างๆของ Status นั้นๆ
            
        end,
    },
    ['stress'] = {
        Type = "plus", -- @==> ถ้าตั้งเป็น remove หลอดจะลดจากมากสุดไปน้อยสุด | ถ้าตั้งเป็น plus หลอดจะเพิ่มจากน้อยสุดไปมากสุด
        ChangeCount = 0.01, -- @==> จำนวนที่หลอดลดตามเวลาที่กำหนด 1 ครั้ง

        RemoveHealth = { -- @==> ลดเลือด
            Enable = true, -- @==> เปิดใช้งาน ระบบ ลดเลือดไหม
            StatusCount = 100, -- @==> หาก Type = "remove" จะเป็นจำนวนสเตตัสต่ำกว่าเท่านี้ถึงเริ่มลดเลือด | หาก Type = "plus" จะเป็นจำนวนสเตตัสมากกว่าเท่านี้ถึงเริ่มลดเลือด
            Remove = 1, -- @==> จำนวนเลือดที่ให้ลดตามเวลาต่อครั้ง
        },

        Sound = { -- @==> เล่นเสียง
            Enable = true, -- @==> เปิดใช้งาน ระบบ เล่นเสียงไหม
            Type = "count", -- @==> หากตั้งเป็น loop เสียงจะเล่นซ้ำไปตามเวลาที่กำหนดวนไปเรื่อยๆ | หากตั้งเป็น count เสียงจะเล่นเมื่อถึงจำนวนนั้นๆ

            Settings = { -- @==> หาก loop ให้ใส่แค่จำนวนเดียว หาก count สามารถใส่ได้หลายจำนวน
                [10] = "dosomething",
                [5] = "dosomething",
            },
        },

        MoreSettings = function(Count) -- @==> Custom ฟั่งชั่นต่างๆของ Status นั้นๆ
            
        end,
    },
}